<?php
/**
 * Checkout Form
 *
 * This template can be overridden by copying it to yourtheme/woocommerce/checkout/form-checkout.php.
 *
 * HOWEVER, on occasion WooCommerce will need to update template files and you
 * (the theme developer) will need to copy the new files to your theme to
 * maintain compatibility. We try to do this as little as possible, but it does
 * happen. When this occurs the version of the template file will be bumped and
 * the readme will list any important changes.
 *
 * @see https://woo.com/document/template-structure/
 * @package WooCommerce\Templates
 * @version 3.5.0
 */

if ( ! defined( 'ABSPATH' ) ) {
	exit;
}

//

// If checkout registration is disabled and not logged in, the user cannot checkout.
if ( ! $checkout->is_registration_enabled() && $checkout->is_registration_required() && ! is_user_logged_in() ) {
	echo esc_html( apply_filters( 'woocommerce_checkout_must_be_logged_in_message', __( 'You must be logged in to checkout.', 'woocommerce' ) ) );
	return;
}

?>

<section class="checkout">
    <div class="content-width">
        <ul class="breadcrumb">
            <li><a href="<?= home_url() ?>"><img src="<?= get_template_directory_uri() ?>/img/icon-9.svg" alt="">חזרה</a></li>
        </ul>
        <h1>ביצוע הזמנה</h1>
        <form name="checkout" method="post" class="checkout woocommerce-checkout" action="<?php echo esc_url( wc_get_checkout_url() ); ?>">
            <div class="content">
                <div class="main">
                    <h3 class="title">פרטים</h3>
                    <div class="form-wrap form-default">
                        <div class="input-wrap">
                            <input type="text" name="billing_first_name" id="name" placeholder="Name" required>
                            <label for="name">שם פרטי *</label>
                        </div>
                        <div class="input-wrap">
                            <input type="text" name="billing_last_name" id="surname" placeholder="Surname" required>
                            <label for="surname">שם משפחה *</label>
                        </div>
                        <div class="input-wrap">
                            <input type="email" name="billing_email" id="email" placeholder="example@gmail.com" required>
                            <label for="email">שם משפחה *</label>
                        </div>
                        <div class="input-wrap">
                            <input type="tel" name="billing_phone" id="tel" placeholder="+972 000 000 00 00" required class="tel">
                            <label for="tel">מספר טלפון *</label>
                        </div>
                        <div class="input-wrap">
                            <input type="number" name="billing_guests" id="number" placeholder="10" required>
                            <label for="number">כמות המשתתפים *</label>
                        </div>
                        <div class="input-wrap-checked">
                            <input type="checkbox" name="billing_check" id="check" checked value="1">
                            <label for="check">הנני מאשר כי קיבלתי לידי את התנאים הכלליים המצורפים על נספחיהם, אלה הוסברו לי ואני מסכים לתוכנם</label>
                        </div>
                    </div>




                </div>
                <?php do_action( 'woocommerce_checkout_order_review' ); ?>

            </div>


            <div class="content">
                <div class="main">
                    <h3 class="title">משלוח</h3>
                    <?php do_action( 'woocommerce_checkout_shipping' ); ?>
                </div>
                <div class="aside">
                    <h3 class="title">Payment</h3>
                    <?php woocommerce_checkout_payment(); ?>
                </div>
            </div>
        </form>


    </div>
</section>

<div id="auto-popup" class="auto-popup"  dir="rtl" style="display: none">
    <div class="main">
        <h2 class="title">טופס הזמנה - מתנפחים ונהנים</h2>
        <p class="mb-0">כתובת: הר חזון 20, כפר סב</p>
        <p>אפרטי מתנפחים ונהנים</p>

        <p class="mb-0">טלפון: 050-5544516</p>
        <p>דוא"ל: <a href="mailto:Mitnafun@gmail.com">Mitnafun@gmail.com</a></p>

        <p class="mb-0">תנאי התשלום</p>
        <ul class="mb-0">
            <li>השוכר ישלם את מלוא התמורה בעת הזמנה ו/או חתימה על טופס ההזמנה לצורך הבטחת ההזמנה והבטחת תקופת ההשכרה.</li>
            <li>ביטול הזמנה ו/או השכרה של ציוד תעשה עד 72 שעות לפני תקופת ההשכרה, ובלבד שניתן אישור על ידי מתנפחים ונהנים.</li>
            <li>למען הסר ספק, לא יוחזר תשלום בעת ביטול הזמנה או השכרה במסגרת 72 השעות לפני תקופת ההשכרה.</li>
            <li>למען הסר ספק, לא יוחזר תשלום בעת ביטול הזמנה או השכרה במסגרת 72 השעות לפני תקופת ההשכרה.
                במעמד ההזמנה ו/או איסוף הציוד יספק השוכר למתנפחים ונהנים פקדון (כפי שיוגדר בהסכם) עד לאחר השבתו ובדיקת תקינותו של הציוד על ידי מתנפחים ונהנים והכל בהתאם למור בהסכם.</li>
        </ul>
        <p>הזמנה זו כפופה לתנאים הכלליים המצורפים לה על נספחיהם.
            בחתימת השוכר על הזמנה זו הינו מאשר כי קיבל לידיו את התנאים הכלליים המצורפים על נספחיהם, אלה הוסברו לו והוא הסכים לתוכנם.</p>
        <p>תנאים כלליים החלים על טופס הזמנה – מתנפחים ונהנים</p>
        <p>מסמך זה מפרט את התנאים הכלליים החלים על ההתקשרות שבין נתנאל איתן ("מתנפחים ונהנים") לבין הלקוח ("השוכר") שפרטיו מצוינים בהזמנת השירותים ("טופס ההזמנה"). תנאים אלו יחולו על המוצרים שהושכרו במסגרת טופס ההזמנה, על השימוש בהם ועל כל נגזרת של אלה, לפי הרלוונטיות והעניין. בכל מקרה של סתירה בין האמור במסמך זה לבין האמור בטופס ההזמנה, יגברו הוראות מסמך זה אלא אם נקבע מפורשות אחרת בתנאי טופס ההזמנה. מסמך זה ונספחיו, יחד עם טופס ההזמנה, יכונו יחד להלן: "ההסכם".</p>
        <ol>
            <li>הגדרות.

                <p>למונחים שלהלן תהא המשמעות המפורטת לצידם, אלא אם נאמר מפורשות אחרת או אם הקשר הדברים מחייב אחרת:
                    "דמי הובלה" – עלות הובלת הציוד ואיסופו כמפורט בטופס ההזמנה.</p>
                <p>1.2."דמי שימוש יומיים נוספים" – בגין כל יום איחור בהשבת הציוד, ישלם השוכר דמי שימוש בהתאם לעלות השימוש היומי, קרי, התמורה חלקי מספר ימי תקופת ההשכרה.</p>

                <p>1.3."הוראות בטיחות והפעלה" – הוראות השימוש בציוד של מתנפחים ונהנים כפי שיפורטו בנספח א' המצורף להסכם זה.</p>

                <p>1.4."מועד השבה" – מועד החזרת הציוד למתנפחים ונהנים כמפורט בטופס ההזמנה.</p>
                <p>1.5."מועד מסירה" – מועד מסירת הציוד לשוכר כמפורט בטופס ההזמנה.</p>
                <p>1.6."ציוד" (על כל הטיותיו) - מוצריה ו/או שירותיה של מתנפחים ונהנים כמפורט בטופס ההזמנה.</p>
                <p>1.7."פקדון" - פרטי האשראי בצירוף צילום תעודת זהות והרשאה שסיפק השוכר למתנפחים ונהנים להבטחת התחייבויותיו.</p>

                <p>1.8."תמורה" – הסכום שישלם השוכר בעבור השכרת הציוד כמפורט בטופס ההזמנה.</p>

                <p>1.9."תקופת ההשכרה" – תקופת השכרת הציוד כמפורט בטופס ההזמנה ממועד קבלת הציוד לשימוש השוכר ועד למועד החזרתו למתנפחים ונהנים.</p>
                <p>1.10."תקופת ההתקשרות" – כפי שזו מוגדרת בסעיף 7.1.</p>
            </li>
            <li> עיקרי ההתקשרות.
                <p>2.1.השוכר מעוניין לשכור ממתנפחים ונהנים ציוד, והשוכר מצהיר כי ראה את הציוד, בדק אותו ומצא אותו מתאים לצרכיו ומשביע רצון בטיבו, בטבעו ובכלל והוא מעוניין לשכור אותו לשימושו מאת מתנפחים ונהנים.</p>

                <p>2.2.בכפוף לתשלום התמורה ובכפוף לקיום מלוא התחייבויותיו של השוכר על פי הסכם זה, מתנפחים ונהנים תספק לשוכר את הציוד, כהגדרתו לעיל.</p>
                <p>2.3.מובהר כי השימוש בציוד יעשה אך ורק על פי, בהתאם ובכפוף להוראות בטיחות והפעלה של מתנפחים ונהנים.</p>
            </li>
            <li> הציוד.
                <p>3.1.הציוד של מתנפחים ונהנים עומד בסטנדרט הגבוה ביותר ובהתאם לכל דין וחובה שחלים על הציוד ועל מתנפחים ונהנים. הציוד מתוחזק ועובר בדיקות תקינות וניקיון שגרתיות בכדי להבטיח חוויה בלתי נשכחת לשכור.</p>

                <p>3.2.מתנפחים ונהנים מתחייבת למסור לשוכר את הציוד במצבו כפי שהוא במועד המסירה, והשוכר מצהיר שהוא מקבל את הציוד כמצבו במועד המסירה. השוכר מצהיר כי בדק את הציוד ומצא כי הוא תקין, שלם ומתאים לצרכיו, והוא מוותר בזאת על כל טענת אי התאמה ו/או פגם לרבות טענת מום נסתר כלשהו באשר למצבו של הציוד.</p>

                <p>3.3.השימוש בציוד ייעשה בהתאם להוראות בטיחות והפעלה ובמסגרת ההגבלות שחלות על השימוש מכוחן ו/או הוראות והגבלות שנמסרו
                    על ידי מתנפחים ונהנים בכתב או בעל פה ועל פי כל דין וחובה החלים</p>

            </li>
            <li> איסוף או אספקת הציוד.
                <p>4.1.הציוד יימסר לשוכר ויוחזר על ידו בהתאם להסכמת הצדדים מראש ובכתב כאמור בטופס ההזמנה ובהתאם לתנאים הבאים:</p>
                <p>4.1.1.איסוף עצמי – מסירת הציוד לשוכר תתבצע במועד המסירה בכתובת שסוכמה בין הצדדים ובכפוף לקיום מלוא התחייבויותיו של השוכר על פי ההסכם. החזרת הציוד על ידי השוכר תתבצע במועד ההשבה, אל כתובת שסוכמה בין הצדדים ובכפוף לקיום התחייבויותיו על פי ההסכם. במידה ולא סוכמה כתובת בין הצדדים כתובת האיסוף והחזרת הציוד תהיה כתובתה של מתנפחים ונהנים המצוינת בטופס ההזמנה.</p>
                <p>4.1.2.הובלה – מסירת הציוד לשוכר תתבצע במועד המסירה בכתובת שסוכמה בין הצדדים ובכפוף לקיום מלוא התחייבויות השוכר על פי ההסכם לרבות תשלום דמי ההובלה. החזרת הציוד על ידי השוכר תתבצע במועד ההשבה בכתובת שסוכמה בין הצדדים ובכפוף לקיום
                    התחייבויותיו על פי ההסכם.</p>

            </li>
            <li>
                <p>
                    5.1.השוכר מתחייב לעשות שימוש בציוד בהתאם להוראות הבטיחות וההפעלה ובמסגרת ההגבלות שחלות על השימוש מכוחן ו/או מכוח הוראות והגבלות שנמסרו על ידי מתנפחים ונהנים ו/או על פי כל דין וחובה החלים עליו לרבות, אך לא רק, בנוגע לאופן להצבת הציוד.</p>
                <p>5.2.השוכר מתחייב לטיפול ודאגה לרמת אחזקה נאותה של הציוד ולשמור על תקינותו וניקיונו למשך כל תקופת ההשכרה (כאמור בסעיף 4.2). השוכר מתחייב להודיע למתנפחים ונהנים ללא דיחוי על כל נזק, תקלה, פגם ו/או ליקוי שנתגלו בציוד.</p>
                <p>5.3.השוכר יהיה מחויב בתיקון ליקויים ו/או פגמים שיתגלו בציוד לרבות, אך לא רק, לכלוכו , אשר נגרמו כתוצאה משימושו של השוכר ו/או מי מטעמו במהלך תקופת ההשכרה, ו/או שנגרמו בגין רשלנותו של השוכר ו/או משימוש שלא בהתאם להוראות הבטיחות והפעלה  ו/או הנחיות שניתנו לו הן בכתב והן בעל פה, להוציא ליקויים ו/או פגמים עקב בלאי סביר.</p>
                <p>5.4.השוכר מכיר בכך שהציוד מיועד לשימוש על ידי ילדים וכי שימוש והפעלה נכונים של הציוד הם הכרחיים למניעת פציעה או נזק. השוכר מתחייב כי יוודא ויבטיח שכל המשתמשים בציוד פועלים בזהירותו על פי הוראות בטיחות והפעלה.</p>
                <p>5.5.השוכר מתחייב להחזיר את הציוד למתנפחים ונהנים במועד ההשבה וכאמור בסעיף 4. בגין כל איחור ישלם השוכר דמי שימוש יומיים נוספים. אין בתשלום נוסף זה כדי לפצות את מתנפחים ונהנים על הנזק שנגרם בגין האיחור בהשבה.</p>
                <p>5.6.השוכר מתחייב כי יישא בעלות תיקון כל ליקוי ו/או פגם ו/או נזק שייגרם לציוד בתקופת ההשכרה באופן מידי לרבות, אך לא רק, לכלוך הציוד. ככל והנזק אינו בר תיקון, מתחייב השוכר לשאת בעלות רכישת ציוד חדש, כזה שניזוק על ידו בתקופת ההשכרה. השוכר ישלם את עלות התיקון ו/או את שווי הציוד החדש, מיד עם דרישה ולא יאוחר מעד 3 ימי עסקים, וזאת כנגד הצגת חשבונית תיקון ו/או חשבונית רכישה על ידי מתנפחים ונהנים.</p>
                <p>
                    5.7.להבטחת מלוא התחייבויות השוכר לפי הסכם זה בכלל ובסעיפים 4 ו- 5 בפרט, יפקיד השוכר פיקדון. חתימת השוכר מהווה הרשאה לפיה השוכר מאשר בזאת למתנפחים ונהנים לעשות שימוש בפיקדון ולחייבו ללא אישור נוסף ו/או התראה, במקרה של הפרת התחייבויותיו על פי סעיפים 4 ו- 5, לרבות לטובת דמי שימוש יומיים נוספים ו/או אי החזרת הציוד ו/או החזרתו כשהוא פגום ו/או מלוכלך ו/או כאשר הציוד הוחרם ו/או בכל מקרה אחר של הפרת תנאי הסכם זה, לרבות אך לא רק, אי השבת הציוד ו/או השבתו פגום וניזוק. מובהר, כי אין בתשלום דמי שימוש יומיים נוספים ו/או תיקון הציוד ו/או כל מקרה אחר של הפרת תנאים אלו ע"י הפיקדון כדי לשחרר את השוכר מחובתו לשפות ו/או לפצות את מתנפחים ונהנים ו/או מי מטעמה בגין כל נזק שהשוכר אחראי לו על פי הסכם זה ו/או על פי כל דין.</p>

            </li>
            <li>התמורה.

                <p>6.1.השוכר מתחייב לשלם למתנפחים ונהנים את התמורה הקבועה בטופס ההזמנה במלואה ובמועדה.</p>
                <p>6.2.השוכר ישלם למתנפחים ונהנים את התמורה בהתאם לתנאי התשלום המצוינים בטופס ההזמנה, וככל שלא צוינו תנאי תשלום, תשולם התמורה בעת אישור טופס ההזמנה.</p>
            </li>
            <li>
                <p>7.1.הסכם זה יהיה בתוקף לתקופת התקשרות שתחילתה ביום חתימת טופס ההזמנה על ידי שני הצדדים ועד לאחר השבת הציוד ובדיקת תקינותו על ידי מתנפחים ונהנים. תקופת ההתקשרות כאמור תסתיים לאחר אישורה בכתב של מתנפחים ונהנים  להשבת הציוד במועד הקבוע בטופס ההזמנה ובמצב תקין ו/או לאחר תשלום בגין הפרות התחייבויות השוכר.</p>
                <p>7.2.בנוסף, מתנפחים ונהנים תהיה רשאית לסיים הסכם זה לאלתר וללא צורך במתן  התראה לשוכר, במקרים שלהלן:</p>
                <p>7.2.1.השוכר הפר את הוראות ההסכם ולא תיקן את ההפרה באופן מידי ממועד קבלת התראה בדבר ההפרה.</p>
                <p>7.2.2.השוכר לא שילם למתנפחים ונהנים את התמורה לפי הסכם זה במלואה ובמועדה ו/או כל סכום אחר לו זכאית למתנפחים ונהנים לפי הסכם זה ו/או לפי כל דין</p>
            </li>
        </ol>
        <div class="btn-wrap">
            <a href="#" class="btn-default btn-blue btn-mini" data-fancybox-close>אני מסכים עם מדיניות האתר</a>
        </div>


    </div>
</div>
